In [2]:
import pandas as pd

In [18]:
df1 = pd.DataFrame({'A': ['5', '87', '42', '43'],
                     'B': ['B0', 'B1', 'B0', 'B1'],
                     'C': ['C0', 'C1', 'C2', 'C3']})

df2 = pd.DataFrame({'A1': ['43', '3'],
                     'B': ['B0', 'B1']})

In [6]:
df1

    A   B   C
0   5  B0  C0
1  87  B1  C1
2  42  B0  C2
3  43  B1  C3

In [19]:
df2

   A1   B
0  43  B0
1   3  B1

In [17]:
df1.join(df2)

    A   B   C   A1   B1
0   5  B0  C0   43   B0
1  87  B1  C1    3   B1
2  42  B0  C2  NaN  NaN
3  43  B1  C3  NaN  NaN

In [20]:
df1.merge(df2, on="B", how='inner')

    A   B   C  A1
0   5  B0  C0  43
1  42  B0  C2  43
2  87  B1  C1   3
3  43  B1  C3   3

## Поиск дубликатов

In [3]:
df_d = pd.DataFrame({
    'brand': ['Yum Yum', 'Yum Yum', 'Yum Yum', 'Indomie', 'Indomie', 'Indomie'],
    'style': ['cup', 'cup', 'cup', 'cup', 'pack', 'pack'],
    'rating': [4, 4, 4, 3.5, 15, 5]
})
# Источник: https://aione.ru/python-poisk-i-udalenie-dublikatov-ispolzuya-pandas

In [4]:
df_d

     brand style  rating
0  Yum Yum   cup     4.0
1  Yum Yum   cup     4.0
2  Yum Yum   cup     4.0
3  Indomie   cup     3.5
4  Indomie  pack    15.0
5  Indomie  pack     5.0

In [7]:
df_d[df_d.duplicated() == True]

     brand style  rating
1  Yum Yum   cup     4.0
2  Yum Yum   cup     4.0